sample_files/0/c_CO2.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      c_CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            zeroGradient;
    }
    rightWall
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            zeroGradient;
    }
    upperLiquidInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    lowerLiquidOutlet
    {
        type            zeroGradient;
    }
    upperGasOutlet
    {
        type            zeroGradient;
    }
    lowerGasInlet
    {
        type            fixedValue;
        value           uniform 0.1; //gas inlet concentration
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
