sample_files/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    rightWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    lowerWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    upperWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    upperLiquidInlet
    {
	type		zeroGradient;
    }		

    lowerLiquidOutlet
    {
	type 		zeroGradient;
    }		
    
    upperGasOutlet
    {
	type		fixedValue;
	value		uniform 0;
    }		
    lowerGasInlet
    {
	type		zeroGradient;
    }		

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
