sample_files/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0e-3;

vertices
(
    (0 0 0)
    (1 0 0)
    (2.0 0 0)
    (5.15 0 0)
    (5.25 0 0)
    (0 90.9 0)
    (1 90.9 0)
    (2.0 90.9 0)
    (5.15 90.9 0)
    (5.25 90.9 0)
    (0 0 1)
    (1 0 1)
    (2.0 0 1)
    (5.15 0 1)
    (5.25 0 1)
    (0 90.9 1)
    (1 90.9 1)
    (2.0 90.9 1)
    (5.15 90.9 1)
    (5.25 90.9 1)
);

blocks
(
    hex (0 1 6 5 10 11 16 15) (40 500 1) simpleGrading (1 1 1)
    hex (1 2 7 6 11 12 17 16) (40 500 1) simpleGrading (1 1 1)
    hex (2 3 8 7 12 13 18 17) (116 500 1) simpleGrading (1 1 1)
    hex (3 4 9 8 13 14 19 18) (4 500 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 10 15 5)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (4 14 19 9)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
//	  (1 2 12 11)  
          (2 3 13 12)
        );
    }
    upperWall
    { 
	type wall;
	faces
	(
	    (6 7 17 16)
            (7 8 18 17)
//            (6 16 18 8)
	);
    }
  
    upperLiquidInlet
    {
	type inletOutlet;
	faces
	(
	    (5 6 16 15)
	);
    }
    lowerLiquidOutlet
    {
	type inletOutlet;
	faces
	(
	    (0 1 11 10)
	    (1 2 12 11)
//	    (0 2 12 10)

	);
    }
    upperGasOutlet
    {
	type inletOutlet;
	faces
	(
	    (8 9 19 18)
	);
    }
    lowerGasInlet
    {
	type inletOutlet;
	faces
	(
	    (3 4 14 13)
	);
    }

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
